apache/nuttx/arch/arm/src/stm32f4/hardware/stm32f412xx_pinmap.h
/****************************************************************************
 * arch/arm/src/stm32f4/hardware/stm32f412xx_pinmap.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 *  Licensed to the Apache Software Foundation (ASF) under one or more
 *  contributor license agreements.  See the NOTICE file distributed with
 *  this work for additional information regarding copyright ownership.  The
 *  ASF licenses this file to you under the Apache License, Version 2.0 (the
 *  "License"); you may not use this file except in compliance with the
 *  License.  You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 *  License for the specific language governing permissions and limitations
 *  under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32_HARDWARE_STM32F412XX_PINMAP_H
#define __ARCH_ARM_SRC_STM32_HARDWARE_STM32F412XX_PINMAP_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "stm32_gpio.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Alternate Pin Functions.  All members of the STM32F40xxx family share the
 * same pin multiplexing (although they may differ in the pins physically
 * available).
 *
 * Alternative pin selections are provided with a numeric suffix like _1, _2,
 * etc. Drivers, however, will use the pin selection without the numeric
 * suffix. Additional definitions are required in the board.h file.  For
 * example, if CAN1_RX connects via PA11 on some board, then the following
 * definitions should appear in the board.h header file for that board:
 *
 * #define GPIO_CAN1_RX GPIO_CAN1_RX_1
 *
 * The driver will then automatically configure PA11 as the CAN1 RX pin.
 */

/* WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as
 * frequency, open-drain/push-pull, and pull-up/down!  Just the basics are
 * defined for most pins in this file.
 */

/* ADC */

#define GPIO_ADC1_IN0_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN0)
#define GPIO_ADC1_IN1_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN1)
#define GPIO_ADC1_IN2_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN2)
#define GPIO_ADC1_IN3_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN3)
#define GPIO_ADC1_IN4_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN4)
#define GPIO_ADC1_IN5_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN5)
#define GPIO_ADC1_IN6_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN6)
#define GPIO_ADC1_IN7_0  (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN7)
#define GPIO_ADC1_IN8_0  (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN0)
#define GPIO_ADC1_IN9_0  (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN1)
#define GPIO_ADC1_IN10_0 (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN0)
#define GPIO_ADC1_IN11_0 (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN1)
#define GPIO_ADC1_IN12_0 (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN2)
#define GPIO_ADC1_IN13_0 (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN3)
#define GPIO_ADC1_IN14_0 (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN4)
#define GPIO_ADC1_IN15_0 (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN5)

/* CAN */

#define GPIO_CAN1_RX_1  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN11)
#define GPIO_CAN1_RX_2  (GPIO_ALT | GPIO_AF8 |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN8)
#define GPIO_CAN1_RX_3  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN0)
#define GPIO_CAN1_RX_4  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTG | GPIO_PIN0)
#define GPIO_CAN1_TX_1  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN12)
#define GPIO_CAN1_TX_2  (GPIO_ALT | GPIO_AF8 |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN9)
#define GPIO_CAN1_TX_3  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN1)
#define GPIO_CAN1_TX_4  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTG | GPIO_PIN1)

#define GPIO_CAN2_RX_1  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN5)
#define GPIO_CAN2_RX_2  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN12)
#define GPIO_CAN2_RX_3  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTG | GPIO_PIN11)
#define GPIO_CAN2_TX_1  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN13)
#define GPIO_CAN2_TX_2  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)
#define GPIO_CAN2_TX_3  (GPIO_ALT | GPIO_AF9 |  GPIO_PUSHPULL | GPIO_PORTG | GPIO_PIN12)

/* Digital filter for sigma delta modulators */

#define GPIO_DFSDM1_CKOUT_1  (GPIO_ALT | GPIO_AF6  |  GPIO_PUSHPULL | GPIO_PORTE | GPIO_PIN9)
#define GPIO_DFSDM1_CKOUT_2  (GPIO_ALT | GPIO_AF8  |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN2)
#define GPIO_DFSDM1_CKIN0_1  (GPIO_ALT | GPIO_AF6  |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN2)
#define GPIO_DFSDM1_CKIN0_2  (GPIO_ALT | GPIO_AF6  |  GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN4)
#define GPIO_DFSDM1_CKIN1_1  (GPIO_ALT | GPIO_AF8  |  GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN5)
#define GPIO_DFSDM1_CKIN1_2  (GPIO_ALT | GPIO_AF10 |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN13)
#define GPIO_DFSDM1_CKIN1_3  (GPIO_ALT | GPIO_AF6  |  GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN7)
#define GPIO_DFSDM1_CKIN2_1  (GPIO_ALT | GPIO_AF8  |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN15)
#define GPIO_DFSDM1_CKIN2_2  (GPIO_ALT | GPIO_AF6  |  GPIO_PUSHPULL | GPIO_PORTE | GPIO_PIN8)
#define GPIO_DFSDM1_CKIN3_1  (GPIO_ALT | GPIO_AF6  |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN6)
#define GPIO_DFSDM1_CKIN3_2  (GPIO_ALT | GPIO_AF8  |  GPIO_PUSHPULL | GPIO_PORTE | GPIO_PIN5)

#define GPIO_DFSDM1_DATIN0_1  (GPIO_ALT | GPIO_AF8  |GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN1)
#define GPIO_DFSDM1_DATIN0_2  (GPIO_ALT | GPIO_AF6  |GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN3)
#define GPIO_DFSDM1_DATIN1_1  (GPIO_ALT | GPIO_AF8  |GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN4)
#define GPIO_DFSDM1_DATIN1_2  (GPIO_ALT | GPIO_AF10 |GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN12)
#define GPIO_DFSDM1_DATIN1_3  (GPIO_ALT | GPIO_AF6  |GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN6)
#define GPIO_DFSDM1_DATIN2_1  (GPIO_ALT | GPIO_AF8  |GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN14)
#define GPIO_DFSDM1_DATIN2_2  (GPIO_ALT | GPIO_AF6  |GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTE | GPIO_PIN7)
#define GPIO_DFSDM1_DATIN3_1  (GPIO_ALT | GPIO_AF10 |GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN7)
#define GPIO_DFSDM1_DATIN3_2  (GPIO_ALT | GPIO_AF8  |GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTE | GPIO_PIN4)

/* Clocks outputs */

#define GPIO_MCO1_0 (GPIO_ALT | GPIO_AF0 |  GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN8)
#define GPIO_MCO2_0 (GPIO_ALT | GPIO_AF0 |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN9)

