apache/nuttx/arch/arm/src/stm32f4/hardware/stm32f412xx_pinmap.h
/* Flexible Static Memory Controller (FSMC) */

#define GPIO_FSMC_A0_1   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN0)
#define GPIO_FSMC_A0_2   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTC | GPIO_PIN3)

#define GPIO_FSMC_A1_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN1)
#define GPIO_FSMC_A2_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN2)
#define GPIO_FSMC_A3_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN3)
#define GPIO_FSMC_A4_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN4)
#define GPIO_FSMC_A5_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN5)
#define GPIO_FSMC_A6_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN12)
#define GPIO_FSMC_A7_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN13)
#define GPIO_FSMC_A8_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN14)
#define GPIO_FSMC_A9_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTF | GPIO_PIN15)
#define GPIO_FSMC_A10_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN0)
#define GPIO_FSMC_A11_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN1)
#define GPIO_FSMC_A12_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN2)
#define GPIO_FSMC_A13_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN3)
#define GPIO_FSMC_A14_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN4)
#define GPIO_FSMC_A15_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN5)
#define GPIO_FSMC_A16_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN11)
#define GPIO_FSMC_A17_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN12)
#define GPIO_FSMC_A18_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN13)
#define GPIO_FSMC_A19_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN3)
#define GPIO_FSMC_A20_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN4)
#define GPIO_FSMC_A21_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN5)
#define GPIO_FSMC_A22_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN6)
#define GPIO_FSMC_A23_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN2)
#define GPIO_FSMC_A24_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN13)
#define GPIO_FSMC_A25_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN14)

#define GPIO_FSMC_CLK_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN3)

#define GPIO_FSMC_D0_1   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN14)
#define GPIO_FSMC_D0_2   (GPIO_ALT | GPIO_AF10 |  GPIO_PORTB | GPIO_PIN14)
#define GPIO_FSMC_D1_1   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN15)
#define GPIO_FSMC_D1_2   (GPIO_ALT | GPIO_AF10 |  GPIO_PORTC | GPIO_PIN6)
#define GPIO_FSMC_D2_1   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN0)
#define GPIO_FSMC_D2_2   (GPIO_ALT | GPIO_AF10 |  GPIO_PORTC | GPIO_PIN11)
#define GPIO_FSMC_D3_1   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN1)
#define GPIO_FSMC_D3_2   (GPIO_ALT | GPIO_AF10 |  GPIO_PORTC | GPIO_PIN12)
#define GPIO_FSMC_D4_1   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN7)
#define GPIO_FSMC_D4_2   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTA | GPIO_PIN2)
#define GPIO_FSMC_D5_1   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN8)
#define GPIO_FSMC_D5_2   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTA | GPIO_PIN3)
#define GPIO_FSMC_D6_1   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN9)
#define GPIO_FSMC_D6_2   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTA | GPIO_PIN4)
#define GPIO_FSMC_D7_1   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN10)
#define GPIO_FSMC_D7_2   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTA | GPIO_PIN5)
#define GPIO_FSMC_D8_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN11)
#define GPIO_FSMC_D9_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN12)
#define GPIO_FSMC_D10_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN13)
#define GPIO_FSMC_D11_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN14)
#define GPIO_FSMC_D12_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN15)
#define GPIO_FSMC_D13_1  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN8)
#define GPIO_FSMC_D13_2  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTB | GPIO_PIN12)
#define GPIO_FSMC_D14_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN9)
#define GPIO_FSMC_D15_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN10)

#define GPIO_FSMC_DA0_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN14)
#define GPIO_FSMC_DA1_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN15)
#define GPIO_FSMC_DA2_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN0)
#define GPIO_FSMC_DA3_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN1)
#define GPIO_FSMC_DA4_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN7)
#define GPIO_FSMC_DA5_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN8)
#define GPIO_FSMC_DA6_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN9)
#define GPIO_FSMC_DA7_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN10)
#define GPIO_FSMC_DA8_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN11)
#define GPIO_FSMC_DA9_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN12)
#define GPIO_FSMC_DA10_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN13)
#define GPIO_FSMC_DA11_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN14)
#define GPIO_FSMC_DA12_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN15)
#define GPIO_FSMC_DA13_1  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTB | GPIO_PIN12)
#define GPIO_FSMC_DA13_2  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN8)
#define GPIO_FSMC_DA14_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN9)
#define GPIO_FSMC_DA15_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN10)

#define GPIO_FSMC_NBL0_0 (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN0)
#define GPIO_FSMC_NBL1_0 (GPIO_ALT | GPIO_AF12 |  GPIO_PORTE | GPIO_PIN1)

#define GPIO_FSMC_NE1_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN7)
#define GPIO_FSMC_NE2_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN9)
#define GPIO_FSMC_NE3_0  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN10)
#define GPIO_FSMC_NE4_1  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTC | GPIO_PIN4)
#define GPIO_FSMC_NE4_2  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTG | GPIO_PIN12)

#define GPIO_FSMC_NL_0   (GPIO_ALT | GPIO_AF12 |  GPIO_PORTB | GPIO_PIN7)

#define GPIO_FSMC_NOE_1  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN4)
#define GPIO_FSMC_NOE_2  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTC | GPIO_PIN5)

#define GPIO_FSMC_NWAIT_0 (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN6)

#define GPIO_FSMC_NWE_1  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTC | GPIO_PIN2)
#define GPIO_FSMC_NWE_2  (GPIO_ALT | GPIO_AF10 |  GPIO_PORTD | GPIO_PIN2)
#define GPIO_FSMC_NWE_3  (GPIO_ALT | GPIO_AF12 |  GPIO_PORTD | GPIO_PIN5)

/* I2C */

#define GPIO_I2C1_SCL_1  (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN6)
#define GPIO_I2C1_SCL_2  (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN8)
#define GPIO_I2C1_SDA_1  (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I2C1_SDA_2  (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I2C1_SMBA_0 (GPIO_ALT | GPIO_AF4 |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN5)

