apache/nuttx/arch/arm/src/stm32f4/hardware/stm32f412xx_pinmap.h
#define GPIO_I2C2_SCL_1   (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN10)
#define GPIO_I2C2_SCL_2   (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTF | GPIO_PIN1)
#define GPIO_I2C2_SDA_1   (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN11)
#define GPIO_I2C2_SDA_2   (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTF | GPIO_PIN0)
#define GPIO_I2C2_SDA_3   (GPIO_ALT | GPIO_AF9 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN3)
#define GPIO_I2C2_SDA_4   (GPIO_ALT | GPIO_AF9 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I2C2_SMBA_1  (GPIO_ALT | GPIO_AF4 |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN12)
#define GPIO_I2C2_SMBA_2  (GPIO_ALT | GPIO_AF4 |  GPIO_PUSHPULL | GPIO_PORTF | GPIO_PIN2)

#define GPIO_I2C3_SCL_1  (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTA | GPIO_PIN8)
#define GPIO_I2C3_SDA_1  (GPIO_ALT | GPIO_AF4 |  GPIO_OPENDRAIN | GPIO_PORTC | GPIO_PIN9)
#define GPIO_I2C3_SDA_2  (GPIO_ALT | GPIO_AF9 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN4)
#define GPIO_I2C3_SDA_3  (GPIO_ALT | GPIO_AF9 |  GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN8)
#define GPIO_I2C3_SMBA_0 (GPIO_ALT | GPIO_AF4 |  GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN9)

/* I2S */

#define GPIO_I2S1_CK_1     (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_I2S1_CK_2     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_I2S1_MCK_0    (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN4)
#define GPIO_I2S1_SD_1     (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_I2S1_SD_2     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_I2S1_WS_1     (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_I2S1_WS_2     (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN15)

#define GPIO_I2S2_CK_1     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_I2S2_CK_2     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_I2S2_CK_3     (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_I2S2_CK_4     (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_I2S2_SD_1     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_I2S2_SD_2     (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_I2S2_WS_1     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_I2S2_WS_2     (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I2S2_MCK_1    (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_I2S2_MCK_2    (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_I2S2_MCK_3    (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_I2S2EXT_SD_1  (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN)
#define GPIO_I2S2EXT_SD_2  (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN)
#define GPIO_I2S2_CKIN_1   (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_I2S2_CKIN_2   (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_I2S2_CKIN_3   (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN1)

#define GPIO_I2S3_CK_1     (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_I2S3_CK_2     (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_I2S3_CK_3     (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_I2S3_MCK_1    (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_I2S3_MCK_2    (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_I2S3_SD_1     (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_I2S3_SD_2     (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_I2S3_SD_3     (GPIO_ALT | GPIO_AF5 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_I2S3_WS_1     (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_I2S3_WS_2     (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_I2S3EXT_SD_2  (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN)
#define GPIO_I2S3EXT_SD_1  (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN)

#define GPIO_I2S4_CK_1    (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_I2S4_CK_2    (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_I2S4_CK_3    (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_I2S4_SD_1    (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_I2S4_SD_2    (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_I2S4_SD_3    (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_I2S4_WS_1    (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_I2S4_WS_2    (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_I2S4_WS_3    (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN11)

#define GPIO_I2S5_CK_1    (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_I2S5_CK_2    (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_I2S5_CK_3    (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_I2S5_SD_1    (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_I2S5_SD_2    (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_I2S5_SD_3    (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_I2S5_SD_4    (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_I2S5_WS_1    (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_I2S5_WS_2    (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_I2S5_WS_3    (GPIO_ALT | GPIO_AF6 | GPIO_PORTE | GPIO_PIN11)

/* JTAG */

#define GPIO_JTCK_SWCLK_0 (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_JTDI_0       (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_JTDO_SWO_0   (GPIO_ALT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_JTMS_SWDIO_0 (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN13)
#define GPIO_JTRST_0      (GPIO_ALT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN4)

/* OTG FS/HS (VBUS PA9 is not an alternate configuration) */

#define GPIO_OTGFS_DM_0   (GPIO_ALT | GPIO_FLOAT  | GPIO_AF10 |  GPIO_PUSHPULL  | GPIO_PORTA | GPIO_PIN11)
#define GPIO_OTGFS_DP_0   (GPIO_ALT | GPIO_FLOAT  | GPIO_AF10 |  GPIO_PUSHPULL  | GPIO_PORTA | GPIO_PIN12)
#define GPIO_OTGFS_ID_0   (GPIO_ALT | GPIO_PULLUP | GPIO_AF10 |  GPIO_OPENDRAIN | GPIO_PORTA | GPIO_PIN10)
#define GPIO_OTGFS_SOF_0  (GPIO_ALT | GPIO_FLOAT  | GPIO_AF10 |  GPIO_PUSHPULL  | GPIO_PORTA | GPIO_PIN8)
#define GPIO_OTGFS_VBUS_0 (GPIO_ALT | GPIO_FLOAT  | GPIO_AF10 |  GPIO_PUSHPULL  | GPIO_PORTA | GPIO_PIN9)

/* RTC */

#define GPIO_RTC_50HZ_0 (GPIO_ALT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN15)

/* SDIO
 *
 * Note that the below configures GPIO_SPEED_50MHz I/O, that means for using
 * the SDIO that you must enable I/O Compensation via the configuration
 * option CONFIG_STM32_SYSCFG_IOCOMPENSATION=y.
 */

#define GPIO_SDIO_CMD_1  (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN2)
#define GPIO_SDIO_CMD_2  (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN6)
#define GPIO_SDIO_D0_1   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN8)
#define GPIO_SDIO_D0_2   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)
#define GPIO_SDIO_D0_3   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN4)
#define GPIO_SDIO_D3_1   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN11)
#define GPIO_SDIO_D3_2   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN5)
#define GPIO_SDIO_D4_0   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN8)
#define GPIO_SDIO_D5_0   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN9)
#define GPIO_SDIO_D6_1   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN6)
#define GPIO_SDIO_D6_2   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN14)
#define GPIO_SDIO_D7_1   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN7)
#define GPIO_SDIO_D7_2   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN10)
#define GPIO_SDIO_D1_1   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN9)
#define GPIO_SDIO_D1_2   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN8)
#define GPIO_SDIO_D2_1   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN10)
#define GPIO_SDIO_D2_2   (GPIO_ALT | GPIO_AF12 | GPIO_PULLUP |  GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN9)
#define GPIO_SDIO_CK_1   (GPIO_ALT | GPIO_AF12 | GPIO_FLOAT  |  GPIO_PORTC | GPIO_PIN12)
#define GPIO_SDIO_CK_2   (GPIO_ALT | GPIO_AF12 | GPIO_FLOAT  |  GPIO_PORTB | GPIO_PIN15)

/* SPI */

#define GPIO_SPI1_MISO_1  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTA | GPIO_PIN6)
#define GPIO_SPI1_MISO_2  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTB | GPIO_PIN4)
#define GPIO_SPI1_MOSI_1  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTA | GPIO_PIN7)
#define GPIO_SPI1_MOSI_2  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTB | GPIO_PIN5)
#define GPIO_SPI1_NSS_1   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTA | GPIO_PIN15)
#define GPIO_SPI1_NSS_2   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTA | GPIO_PIN4)
#define GPIO_SPI1_SCK_1   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTA | GPIO_PIN5)
#define GPIO_SPI1_SCK_2   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTB | GPIO_PIN3)

#define GPIO_SPI2_MISO_1  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTB | GPIO_PIN14)
#define GPIO_SPI2_MISO_2  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTC | GPIO_PIN2)
#define GPIO_SPI2_MOSI_1  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTB | GPIO_PIN15)
#define GPIO_SPI2_MOSI_2  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTC | GPIO_PIN3)
#define GPIO_SPI2_NSS_1   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTB | GPIO_PIN12)
#define GPIO_SPI2_NSS_2   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTB | GPIO_PIN9)
#define GPIO_SPI2_SCK_1   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTB | GPIO_PIN10)
#define GPIO_SPI2_SCK_2   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTB | GPIO_PIN13)
#define GPIO_SPI2_SCK_3   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTC | GPIO_PIN7)
#define GPIO_SPI2_SCK_4   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTD | GPIO_PIN3)

