apache/nuttx/arch/arm/src/stm32f4/hardware/stm32f412xx_pinmap.h
#define GPIO_SPI3_MISO_1  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTB | GPIO_PIN4)
#define GPIO_SPI3_MISO_2  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTC | GPIO_PIN11)
#define GPIO_SPI3_MOSI_1  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTB | GPIO_PIN5)
#define GPIO_SPI3_MOSI_2  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTC | GPIO_PIN12)
#define GPIO_SPI3_MOSI_3  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTD | GPIO_PIN6)
#define GPIO_SPI3_NSS_1   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTA | GPIO_PIN15)
#define GPIO_SPI3_NSS_2   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTA | GPIO_PIN4)
#define GPIO_SPI3_SCK_1   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTB | GPIO_PIN3)
#define GPIO_SPI3_SCK_2   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTC | GPIO_PIN10)
#define GPIO_SPI3_SCK_3   (GPIO_ALT | GPIO_AF7 |  GPIO_PORTB | GPIO_PIN12)

#define GPIO_SPI4_MISO_1  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTE | GPIO_PIN5)
#define GPIO_SPI4_MISO_2  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTE | GPIO_PIN13)
#define GPIO_SPI4_MISO_3  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTA | GPIO_PIN11)
#define GPIO_SPI4_MOSI_1  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTE | GPIO_PIN6)
#define GPIO_SPI4_MOSI_2  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTE | GPIO_PIN14)
#define GPIO_SPI4_MOSI_3  (GPIO_ALT | GPIO_AF5 |  GPIO_PORTA | GPIO_PIN1)
#define GPIO_SPI4_NSS_1   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTE | GPIO_PIN4)
#define GPIO_SPI4_NSS_2   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTE | GPIO_PIN11)
#define GPIO_SPI4_NSS_3   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTB | GPIO_PIN12)
#define GPIO_SPI4_SCK_1   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTE | GPIO_PIN2)
#define GPIO_SPI4_SCK_2   (GPIO_ALT | GPIO_AF5 |  GPIO_PORTE | GPIO_PIN12)
#define GPIO_SPI4_SCK_3   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTB | GPIO_PIN13)

#define GPIO_SPI5_MISO_1  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTA | GPIO_PIN12)
#define GPIO_SPI5_MISO_2  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTE | GPIO_PIN5)
#define GPIO_SPI5_MISO_3  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTE | GPIO_PIN13)
#define GPIO_SPI5_MOSI_1  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTA | GPIO_PIN10)
#define GPIO_SPI5_MOSI_2  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTB | GPIO_PIN8)
#define GPIO_SPI5_MOSI_3  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTE | GPIO_PIN6)
#define GPIO_SPI5_MOSI_4  (GPIO_ALT | GPIO_AF6 |  GPIO_PORTE | GPIO_PIN14)
#define GPIO_SPI5_NSS_1   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTB | GPIO_PIN1)
#define GPIO_SPI5_NSS_2   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTE | GPIO_PIN4)
#define GPIO_SPI5_NSS_3   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTE | GPIO_PIN11)
#define GPIO_SPI5_SCK_1   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTB | GPIO_PIN0)
#define GPIO_SPI5_SCK_2   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTE | GPIO_PIN2)
#define GPIO_SPI5_SCK_3   (GPIO_ALT | GPIO_AF6 |  GPIO_PORTE | GPIO_PIN12)

/* Timers */

#define GPIO_TIM1_BKIN_1  (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM1_BKIN_2  (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_TIM1_BKIN_3  (GPIO_ALT | GPIO_AF1 | GPIO_PORTE | GPIO_PIN15)
#define GPIO_TIM1_CH1N_1  (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM1_CH1N_2  (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_TIM1_CH1N_3  (GPIO_ALT | GPIO_AF1 | GPIO_PORTE | GPIO_PIN8)
#define GPIO_TIM1_CH2N_1  (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_TIM1_CH2N_2  (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TIM1_CH2N_3  (GPIO_ALT | GPIO_AF1 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_TIM1_CH3N_1  (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM1_CH3N_2  (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TIM1_CH3N_3  (GPIO_ALT | GPIO_AF1 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_TIM1_ETR_1   (GPIO_ALT | GPIO_AF1 |  GPIO_FLOAT | GPIO_PORTA | GPIO_PIN12)
#define GPIO_TIM1_ETR_2   (GPIO_ALT | GPIO_AF1 |  GPIO_FLOAT | GPIO_PORTE | GPIO_PIN7)
#define GPIO_TIM1_ETR_3   (GPIO_ALT | GPIO_AF1 |  GPIO_FLOAT | GPIO_PORTF | GPIO_PIN10)
#define GPIO_TIM1_CH1_1   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM1_CH1_2   (GPIO_ALT | GPIO_AF1 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_TIM1_CH2_1   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_TIM1_CH2_2   (GPIO_ALT | GPIO_AF1 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_TIM1_CH3_1   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_TIM1_CH3_2   (GPIO_ALT | GPIO_AF1 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_TIM1_CH4_1   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_TIM1_CH4_2   (GPIO_ALT | GPIO_AF1 | GPIO_PORTE | GPIO_PIN14)

#define GPIO_TIM2_CH1_1   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM2_CH1_2   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM2_CH1_3   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TIM2_CH2_1   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM2_CH2_2   (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM2_CH3_1   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM2_CH3_2   (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_TIM2_CH4_1   (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM2_CH4_2   (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_TIM2_ETR_1   (GPIO_ALT | GPIO_AF1 |  GPIO_FLOAT | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM2_ETR_2   (GPIO_ALT | GPIO_AF1 |  GPIO_FLOAT | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TIM2_ETR_3   (GPIO_ALT | GPIO_AF1 |  GPIO_FLOAT | GPIO_PORTA | GPIO_PIN5)

#define GPIO_TIM3_CH1_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM3_CH1_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM3_CH1_3  (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM3_CH2_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM3_CH2_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM3_CH2_3  (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TIM3_CH3_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_TIM3_CH3_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_TIM3_CH4_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM3_CH4_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_TIM3_ETR_0  (GPIO_ALT | GPIO_AF2 |  GPIO_FLOAT | GPIO_PORTD | GPIO_PIN2)

#define GPIO_TIM4_CH1_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM4_CH1_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_TIM4_CH2_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM4_CH2_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_TIM4_CH3_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM4_CH3_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN14)
#define GPIO_TIM4_CH4_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_TIM4_CH4_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTD | GPIO_PIN15)
#define GPIO_TIM4_ETR_0  (GPIO_ALT | GPIO_AF2 |  GPIO_FLOAT | GPIO_PORTE | GPIO_PIN0)
#define GPIO_TIM5_CH1_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM5_CH1_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN3)
#define GPIO_TIM5_CH2_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM5_CH2_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN4)
#define GPIO_TIM5_CH3_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM5_CH3_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN5)
#define GPIO_TIM5_CH4_1  (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM5_CH4_2  (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN10)

