apache/nuttx/arch/arm/src/stm32f4/hardware/stm32f412xx_pinmap.h
/* Quad SPI */

#define GPIO_QUADSPI_BK1_IO0_1  (GPIO_ALT | GPIO_AF10 | GPIO_PORTF | GPIO_PIN8)
#define GPIO_QUADSPI_BK1_IO0_2  (GPIO_ALT | GPIO_AF9  | GPIO_PORTC | GPIO_PIN9)
#define GPIO_QUADSPI_BK1_IO0_3  (GPIO_ALT | GPIO_AF9  | GPIO_PORTD | GPIO_PIN11)
#define GPIO_QUADSPI_BK1_IO1_1  (GPIO_ALT | GPIO_AF10 | GPIO_PORTF | GPIO_PIN9)
#define GPIO_QUADSPI_BK1_IO1_2  (GPIO_ALT | GPIO_AF9  | GPIO_PORTC | GPIO_PIN10)
#define GPIO_QUADSPI_BK1_IO1_3  (GPIO_ALT | GPIO_AF9  | GPIO_PORTD | GPIO_PIN12)
#define GPIO_QUADSPI_BK1_IO2_1  (GPIO_ALT | GPIO_AF9  | GPIO_PORTE | GPIO_PIN2)
#define GPIO_QUADSPI_BK1_IO2_2  (GPIO_ALT | GPIO_AF9  | GPIO_PORTF | GPIO_PIN7)
#define GPIO_QUADSPI_BK1_IO2_3  (GPIO_ALT | GPIO_AF9  | GPIO_PORTC | GPIO_PIN8)
#define GPIO_QUADSPI_BK1_IO3_1  (GPIO_ALT | GPIO_AF9  | GPIO_PORTA | GPIO_PIN1)
#define GPIO_QUADSPI_BK1_IO3_2  (GPIO_ALT | GPIO_AF9  | GPIO_PORTD | GPIO_PIN13)
#define GPIO_QUADSPI_BK1_IO3_3  (GPIO_ALT | GPIO_AF9  | GPIO_PORTF | GPIO_PIN6)
#define GPIO_QUADSPI_BK1_NCS_1  (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_QUADSPI_BK1_NCS_2  (GPIO_ALT | GPIO_AF10 | GPIO_PORTG | GPIO_PIN6)

#define GPIO_QUADSPI_BK2_IO0_1  (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN7)
#define GPIO_QUADSPI_BK2_IO0_2  (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_QUADSPI_BK2_IO1_1  (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN8)
#define GPIO_QUADSPI_BK2_IO1_2  (GPIO_ALT | GPIO_AF10 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_QUADSPI_BK2_IO2_1  (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_QUADSPI_BK2_IO2_2  (GPIO_ALT | GPIO_AF9  | GPIO_PORTG | GPIO_PIN9)
#define GPIO_QUADSPI_BK2_IO2_3  (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN4)
#define GPIO_QUADSPI_BK2_IO3_1  (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN5)
#define GPIO_QUADSPI_BK2_IO3_2  (GPIO_ALT | GPIO_AF10 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_QUADSPI_BK2_IO3_3  (GPIO_ALT | GPIO_AF9  | GPIO_PORTG | GPIO_PIN14)
#define GPIO_QUADSPI_BK2_NCS_0  (GPIO_ALT | GPIO_AF9  | GPIO_PORTC | GPIO_PIN11)

#define GPIO_QUADSPI_CLK_1      (GPIO_ALT | GPIO_AF9  | GPIO_PORTB | GPIO_PIN1)
#define GPIO_QUADSPI_CLK_2      (GPIO_ALT | GPIO_AF9  | GPIO_PORTB | GPIO_PIN2)
#define GPIO_QUADSPI_CLK_3      (GPIO_ALT | GPIO_AF9  | GPIO_PORTD | GPIO_PIN3)

#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32F412XX_PINMAP_H */
